/*
4-6 实验3_6_打印图形一

用’-‘(减号)、’+’(加号)、’|’(竖线)、’*’星号和空格打印方格。

输入格式:
只有一行，为用空格分隔的两个整数l,c（0<l,c<10）。其中l和c分别代表格子的行数和列数。请看输入样例。

输出格式:
每组测试用例输出一组（请看输出样例）。

输入样例:
2 3
输出样例:
|*****|*****|*****|
|  |  |  |  |  |  |
|--+--|--+--|--+--|
|  |  |  |  |  |  |
|*****|*****|*****|
|  |  |  |  |  |  |
|--+--|--+--|--+--|
|  |  |  |  |  |  |
|*****|*****|*****|
*/
#include <stdio.h>

int main(void)
{
    int x, y;
    scanf("%d %d", &x, &y);

    for (int i = 0; i < 4 * x + 1; i++)
    {
        printf("|");
        if (i == 0)
        {
            for (int j = 0; j < y; j++)
            {
                printf("*****|");
            }
            printf("\n");
        }
        else
        {
            for (int j = 0; j < y; j++)
            {
                if (i % 2 == 1)
                    printf("  |  |");
                else if (i % 4 == 0)
                    printf("*****|");
                else
                    printf("--+--|");
            }
            printf("\n");
        }
    }

    return 0;
}